# გამოიცანი რიცხვი 1-დან 100-მდე

import random


num = random.randint(1,101) # ეს ფუნქცია ირჩევს რიცხვებს შემთხვევითობის პრინციპით 1-დან 100მდე
count = 1
print("გამოიცანით რიცხვი 1-დან 100-მდე")
while True: 

    '''
    სანამ user არ გამოიცნობს რიცხვს იქამდე მისცემს მინიშნებებს და მცდელობებს
    რათა გამოიცნოს რიცხვი
    '''
    
    try:
        guess = int(input(f"რიცხვი (მცდელობა {count}): "))
        if guess < 0:
            print("რიცხვები უნდა იყოს მხოლოდ 1-დან 100-მდე!!")
        else:
            if guess > num:
                print("თქვენი რიცხვი მეტია გამოსაცნობ რიცხვზე!!")
            elif guess < num:
                print("თქვენი რიცხვი ნაკლებია გამოსაცნობ რიცხვზე!!")
            else:
                print("ყოჩაღ! თქვენ გამოიცანით რიცხვი!")
                break

 
        
        count += 1
    except ValueError:
        print("შეიყვანეთ რიცხვი!!")



        
